tutorials/turbulenceDamping/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    inletLiquidFilm
    {
        type            mapped;
        field           U;
        setAverage      1;
        average         (0.5 0 0);
        interpolationScheme cell;
        value           uniform (0.5 0 0);
    }
    inletBulk
    {
        type            mapped;
        field           U;
        setAverage      1;
        average         (3.24286 0 0);
        interpolationScheme cell;
        value           uniform (3.24286 0 0);
    }
    outlet
    {
        type            advective;
//        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
    upWall
    {
        type            noSlip;
    }
    downWall
    {
        type            noSlip;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    baf0_half0
    {
        type            noSlip;
    }
    baf0_half1
    {
        type            noSlip;
    }
}


// ************************************************************************* //
