tutorials/turbulenceDamping/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.0001";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1;

boundaryField
{
    inletLiquidFilm
    {
        type            mapped;
        field           k;
        setAverage      0;
        average         0.001;
        interpolationScheme cell;
        value           uniform 0.001;
    }
    inletBulk
    {
        type            mapped;
        field           k;
        setAverage      0;
        average         0.001;
        interpolationScheme cell;
        value           uniform 0.001;
    }
    outlet
    {
        type            zeroGradient;
    }
    upWall
    {
        type            kqRWallFunction;
    }
    downWall
    {
        type            kqRWallFunction;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    baf0_half0
    {
        type            kqRWallFunction;
    }
    baf0_half1
    {
        type            kqRWallFunction;
    }
}


// ************************************************************************* //
