tutorials/turbulenceDamping/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication createBaffles -overwrite
rm -rf 0
cp -r 0.orig 0
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
