tutorials/turbulenceDamping/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

turbulenceDamping
{
    type            turbulenceDamping;
    active          true;
    turbulenceDampingCoeffs
    {
        fields      (omega);
        B           120;
        dampingTreatment heavyNegative;
        lengthScale FA;
        explicitSourceTreatment true;
    }
}

// ************************************************************************* //
