tutorials/turbulenceDamping/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    default Euler;
} 

gradSchemes
{
    default         Gauss linear;
}

divSchemes 
{
    div(rhoPhi,U) Gauss limitedLinear 1; 
    div(phi,alpha) Gauss vanLeer; 
    div(phirb,alpha) Gauss interfaceCompression;
    "div\(phi,(k|omega|epsilon)\)"      Gauss vanLeer;
    "div\(rhoPhi,(k|omega|epsilon)\)"      Gauss vanLeer;  
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
