tutorials/turbulenceDamping/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (3.24286 0 0)
);

regions
(
    zoneToCell
    {
        name water;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volVectorFieldValue U (0.5 0 0)
        );
    }
    zoneToCell
    {
        name inwater;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volVectorFieldValue U (0.5 0 0)
        );
    }
);


// ************************************************************************* //
